# SystemtypeRisedrop Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..SystemtypeRisedrop Property
GroupTypeId Class See Also
---
"Rise / Drop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SystemtypeRisedrop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SystemtypeRisedrop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SystemtypeRisedrop {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace